In [76]:
import warnings 
warnings.filterwarnings("ignore")

In [77]:
import pandas as pd

In [78]:
sa=pd.read_csv("salaries.csv")

In [79]:
print(sa)

       company                  job     degree  salary_more_then_100k
0       google      sales executive  bachelors                      0
1       google      sales executive    masters                      0
2       google     business manager  bachelors                      1
3       google     business manager    masters                      1
4       google  computer programmer  bachelors                      0
5       google  computer programmer    masters                      1
6   abc pharma      sales executive    masters                      0
7   abc pharma  computer programmer  bachelors                      0
8   abc pharma     business manager  bachelors                      0
9   abc pharma     business manager    masters                      1
10    facebook      sales executive  bachelors                      1
11    facebook      sales executive    masters                      1
12    facebook     business manager  bachelors                      1
13    facebook     business manager    masters                      1
14    facebook  computer programmer  bachelors                      1
15    facebook  computer programmer    masters                      1

In [80]:
sa.isnull().sum()

company                  0
job                      0
degree                   0
salary_more_then_100k    0
dtype: int64

In [81]:
sa["company"].unique()

array(['google', 'abc pharma', 'facebook'], dtype=object)

In [82]:
sa.shape

(16, 4)

In [83]:
sa["company"].value_counts()

google        6
facebook      6
abc pharma    4
Name: company, dtype: int64

In [84]:
sa['degree'].unique()

array(['bachelors', 'masters'], dtype=object)

In [85]:
sa['degree'].value_counts()

bachelors    8
masters      8
Name: degree, dtype: int64

In [86]:
sa['company']=sa['company'].replace({'google':0,'abc pharma':1,'facebook':2})

In [87]:
sa

    company                  job     degree  salary_more_then_100k
0         0      sales executive  bachelors                      0
1         0      sales executive    masters                      0
2         0     business manager  bachelors                      1
3         0     business manager    masters                      1
4         0  computer programmer  bachelors                      0
5         0  computer programmer    masters                      1
6         1      sales executive    masters                      0
7         1  computer programmer  bachelors                      0
8         1     business manager  bachelors                      0
9         1     business manager    masters                      1
10        2      sales executive  bachelors                      1
11        2      sales executive    masters                      1
12        2     business manager  bachelors                      1
13        2     business manager    masters                      1
14        2  computer programmer  bachelors                      1
15        2  computer programmer    masters                      1

In [88]:
sa['degree']=sa['degree'].replace({'bachelors':0,'masters':1})

In [89]:
sa

    company                  job  degree  salary_more_then_100k
0         0      sales executive       0                      0
1         0      sales executive       1                      0
2         0     business manager       0                      1
3         0     business manager       1                      1
4         0  computer programmer       0                      0
5         0  computer programmer       1                      1
6         1      sales executive       1                      0
7         1  computer programmer       0                      0
8         1     business manager       0                      0
9         1     business manager       1                      1
10        2      sales executive       0                      1
11        2      sales executive       1                      1
12        2     business manager       0                      1
13        2     business manager       1                      1
14        2  computer programmer       0                      1
15        2  computer programmer       1                      1

In [90]:
sa['job'].value_counts()

business manager       6
sales executive        5
computer programmer    5
Name: job, dtype: int64

In [91]:
sa['job']=sa['job'].replace({'business manager':0,'sales executive':1,'computer programmer':2})

In [92]:
sa

    company  job  degree  salary_more_then_100k
0         0    1       0                      0
1         0    1       1                      0
2         0    0       0                      1
3         0    0       1                      1
4         0    2       0                      0
5         0    2       1                      1
6         1    1       1                      0
7         1    2       0                      0
8         1    0       0                      0
9         1    0       1                      1
10        2    1       0                      1
11        2    1       1                      1
12        2    0       0                      1
13        2    0       1                      1
14        2    2       0                      1
15        2    2       1                      1

In [93]:
print(sa.corr().to_string())

                        company       job    degree  salary_more_then_100k
company                1.000000  0.000000  0.000000               0.447214
job                    0.000000  1.000000 -0.075593              -0.214698
degree                 0.000000 -0.075593  1.000000               0.258199
salary_more_then_100k  0.447214 -0.214698  0.258199               1.000000

In [94]:
x=sa.drop(columns=['salary_more_then_100k'])

In [95]:
y=sa['salary_more_then_100k']

In [96]:
print(x)

    company  job  degree
0         0    1       0
1         0    1       1
2         0    0       0
3         0    0       1
4         0    2       0
5         0    2       1
6         1    1       1
7         1    2       0
8         1    0       0
9         1    0       1
10        2    1       0
11        2    1       1
12        2    0       0
13        2    0       1
14        2    2       0
15        2    2       1

In [97]:
print(y)

0     0
1     0
2     1
3     1
4     0
5     1
6     0
7     0
8     0
9     1
10    1
11    1
12    1
13    1
14    1
15    1
Name: salary_more_then_100k, dtype: int64

### DecisionTreeClassifier

In [98]:
from sklearn.tree import DecisionTreeClassifier

In [99]:
model=DecisionTreeClassifier()

In [100]:
1

DecisionTreeClassifier()

In [101]:
ans=model.predict([[1,1,1]])

In [102]:
print(ans)

[0]

In [103]:
model.score(x,y)

1.0

### Logestic Regression

In [110]:
from  sklearn.linear_model import LogisticRegression

In [111]:
modellogestic=LogisticRegression()

In [112]:
modellogestic.fit(x,y)

LogisticRegression()

In [113]:
print(modellogestic.predict([[1,1,2]]))

[1]

In [114]:
modellogestic.score(x,y)

0.75